app/controllers/applicants_controller.rb

SELECT "applicants".* FROM "applicants"
---
  def index
    if !check_permissions?(session[:user_type], "view_applicants")
      redirect_to root_path
    end
    @applicants = Applicant.all

INSERT INTO "users" ("email", "user_type", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["email", "new"], ["user_type", "applicant"], ["created_at", "2021-09-29 02:25:10.193451"], ["updated_at", "2021-09-29 02:25:10.193451"]]
INSERT INTO "applicants" ("name", "password_digest", "email", "phone_number", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    email = params[:applicant][:email]
    userHash = {:email => email, :user_type => "applicant"}
    @applicant = nil
    #
    @user = User.new(userHash)
    respond_to do |format|
      if @user.save
        @applicant = Applicant.new(applicant_params)
        @applicant.user_id = @user.id
        if @applicant.save

UPDATE "applicants" SET "email" = ?, "updated_at" = ? WHERE "applicants"."id" = ?  [["email", "test4"], ["updated_at", "2021-09-29 02:52:33.393204"], ["id", 1]]
---
  def update
    if !check_permissions?(session[:user_type], "edit_applicant")
      redirect_to root_path
    end
    respond_to do |format|
      if @applicant.update(applicant_params)

DELETE FROM "applicants" WHERE "applicants"."id" = ?  [["id", 2]]
---
  def destroy
    if !check_permissions?(session[:user_type], "delete_applicant")
      redirect_to root_path
    end
    @applicant.destroy

SELECT "applicants".* FROM "applicants" WHERE "applicants"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_applicant
      @applicant = Applicant.find(params[:id])