app/controllers/applications_controller.rb

SELECT "applicants".* FROM "applicants" WHERE "applicants"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT "applications".* FROM "applications" WHERE "applications"."applicant_id" = ?  [["applicant_id", 1]]
---
  def index
    @withdraw = false
    if check_permissions?(session[:user_type], "withdraw_application")
      @withdraw = true
    end
    @accept = false
    if check_permissions?(session[:user_type], "accept_application")
      @accept = true
    end

    if current_user.user_type == "applicant"
      @applications = nil
      applicant = Applicant.find_by_user_id(current_user.id)
      if applicant
        @applications = Application.where(applicant_id: applicant.id)

SELECT "applications".* FROM "applications" WHERE "applications"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "applications" SET "status" = ?, "updated_at" = ? WHERE "applications"."id" = ?  [["status", "withdrawn"], ["updated_at", "2021-09-24 07:19:13.958502"], ["id", 2]]
---
  def reject_application
    @application = Application.find_by_id(params[:id])
    respond_to do |format|
      if @application.status == "accepted"
        format.html { redirect_to @application, notice: "It is already accepted" }
      else
        @application.update(status: "rejected")

SELECT "applications".* FROM "applications" WHERE "applications"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "applications" SET "status" = ?, "updated_at" = ? WHERE "applications"."id" = ?  [["status", "withdrawn"], ["updated_at", "2021-09-24 07:19:13.958502"], ["id", 2]]
---
  def withdraw_application
    # if !check_permissions?(session[:user_type], "checkout_applicant")
    #   return redirect_to root_path
    # end
    @application = Application.find_by_id(params[:id])
    respond_to do |format|
      if @application.status != "accepted"
        @application.update(status: "withdrawn")

SELECT "applicants".* FROM "applicants" WHERE "applicants"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "applications".* FROM "applications" WHERE "applications"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "properties".* FROM "properties" WHERE "properties"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "applications" ("status", "created_at", "updated_at", "applicant_id", "property_id") VALUES (?, ?, ?, ?, ?)  [["status", "initiated"], ["created_at", "2021-09-24 07:06:46.701055"], ["updated_at", "2021-09-24 07:06:46.701055"], ["applicant_id", 1], ["property_id", 1]]
---
  def create
    property_id = nil
    if session[:user_type] == "admin"
      property_id = params[:application][:property_id]
    else
      property_id = params[:data][:property]
    end
    @user = nil
    if session[:user_type] == "admin"
      @user = User.find_by_id(Applicant.find_by_id(params[:application][:applicant_id]).user_id)
    else
      @user = User.find_by_id(session[:user_id])
    end

    applicant = Applicant.find_by_user_id(@user.id)

    property = Property.find_by_id(property_id)
    status = "initiated"
    if property.units <= 0
      status = "waitlisted"
    end
    applicationParams = {:status => status, :property_id => property_id, :applicant_id => applicant.id}
    @application = Application.new(applicationParams)
    respond_to do |format|
      if @application.save

SELECT "applications".* FROM "applications" WHERE "applications"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def set_application
      @application = Application.find(params[:id])