app/controllers/properties_controller.rb

  def index
    @allowed = false
    if check_permissions?(session[:user_type], "create_property")
      @allowed = true
    end
    @properties = Property.all
---
SELECT "properties".* FROM "properties"

  def show
    property_feature_id = @property.attributes["property_feature_id"]
    @property_feature = PropertyFeature.find(property_feature_id)
    occupants = Occupant.where(property_id: @property.id)
    @all_applicants = nil
    if session[:user_type] == "admin"
      @all_applicants = Applicant.where.not(id: occupants.ids)
    end
    @applicants = []
    if occupants
      occupants.each do |occupant|
---
SELECT "property_features".* FROM "property_features" WHERE "property_features"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "occupants".* FROM "occupants" WHERE "occupants"."property_id" = ?  [["property_id", 1]]